package com.asma.assignment_10;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;
import androidx.appcompat.app.AppCompatActivity;

public class MainActivity extends AppCompatActivity {
    ListView list;
    String[] title  = {"তাপপ্রবাহ কমছে না, বৃষ্টি হতে পারে মে মাসের শুরুতে","কাঠবোঝাই ট্রলির ধাক্কায় মোটরসাইকেলের আরোহী বাবা-ছেলে নিহত","পুলিশের স্পেশাল ব্রাঞ্চে চাকরি, পদ ৫৪","গরমেও কি ব্যায়াম করা যাবে ", "বড় জয়ে দুইয়ে সিটি, লিভারপুলের দুর্দশার কথা মনে করে তবু সতর্ক গার্দিওলা","চুয়েট শিক্ষার্থীদের আন্দোলন\n" +
            "মালিক–শ্রমিক ও বিআরটিএর ঘুম ভাঙুক","লালদিঘী ময়দানে বৈশাখী মেলা","পবিত্র ওমরাহ পালনকারীদের জন্য যে সুখবর দিল সৌদি আরব"};
    String[] location = {"বিশেষ প্রতিনিধি ঢাকা", "নিজস্ব প্রতিবেদক সাতক্ষীরা", "প্রথম আলো ডেস্ক","লেখা:এম ইয়াছিন আলী", "খেলা ডেস্ক","গ্রাম্য বিরোধ নিষ্পত্তি","জুয়েল শীল","তথ্যসূত্র:গালফ নিউজ, কায়রো"};
    String[] description = {"দেশের বেশির ভাগ এলাকার ওপর দিয়ে বয়ে যাওয়া তাপপ্রবাহ আপাতত কমছে না। উল্টো বাতাসে আর্দ্রতা বেড়ে গরমের অনুভূতি আরও বাড়িয়েছে। কোথাও দমকা হাওয়া বয়ে গেলে তাতেও উষ্ণতা ভর করেছে। ফলে সাধারণ মানুষের গরমের কষ্ট আরও বেড়েছে। তবে আগামী মাসের শুরুতে বৃষ্টির আভাস রয়েছে।\n" +
            "\n" +
            "আবহাওয়াবিদেরা বলছেন, চলতি মাসের বাকি দিনগুলোতে তাপপ্রবাহ কমার সম্ভাবনা নেই। এ সময়ে দিনে গরম তো থাকছেই, রাতেও যে তপ্ত বাতাস বয়ে যাচ্ছে, তা অব্যাহত থাকতে পারে। কারণ, অতীতে সাধারণত এ সময়ে সন্ধ্যায় ঝোড়ো বাতাস বয়ে যেত, এতে গরম কমে যেত। এবার তা-ও নেই। তাই আপাতত গরম কমার সম্ভাবনা নেই; বরং বাতাসে আর্দ্রতা বেড়ে আজ শুক্রবার গরমের কষ্ট আরও বাড়তে পারে। এক সপ্তাহ এ ধরনের আবহাওয়া থাকতে পারে।\n" +
            "আবহাওয়া অধিদপ্তরের পূর্বাভাস বলছে, আগামী মাসের শুরুতে সিলেট ও চট্টগ্রাম বিভাগে বৃষ্টি এবং ঝোড়ো হাওয়া বয়ে যেতে পারে। তখন ওই দুই বিভাগে গরমের কষ্ট কমে আসতে পারে। উত্তরাঞ্চলের জেলাগুলোতে অবশ্য রাজধানী ঢাকা এবং রাজশাহী ও খুলনার মতো এতটা উষ্ণতা নেই। তবে মে মাসের বাকি সময়জুড়ে উত্তরেও গরমের তীব্রতা বেশি থাকতে পারে।\n" +
            "\n" +
            "আবহাওয়া অধিদপ্তরের আবহাওয়াবিদ আবুল কালাম মল্লিক প্রথম আলোকে বলেন, ‘এপ্রিল ও মে এমনিতেই আমাদের এখানে সবচেয়ে উষ্ণ মাস। এবার পূর্ব এশিয়ার মিয়ানমার থেকে থাইল্যান্ড, মালয়েশিয়া হয়ে লাওস পর্যন্ত আর দক্ষিণ এশিয়ায় বাংলাদেশ থেকে ভারত হয়ে পাকিস্তান ও আফগানিস্তান পর্যন্ত তাপপ্রবাহ বয়ে যাচ্ছে।’ তিনি বলেন, মূলত বৈশ্বিক আবহাওয়ায় এল নিনোর প্রভাবে এমন ঘটছে। সেই সঙ্গে বৈশ্বিক তাপমাত্রা বৃদ্ধি এবং এই অঞ্চলে দ্রুত ও অপরিকল্পিত নগরায়ণের কারণে অভ্যন্তরীণ তাপ তৈরি হয়েছে। এই তিন কারণে উষ্ণতা অস্বাভাবিক বেড়ে গেছে।\n" +
            "আবহাওয়া অধিদপ্তরের পর্যবেক্ষণ অনুযায়ী, গতকাল বৃহস্পতিবার দেশের অন্তত ১৪টি জেলার ওপর দিয়ে তীব্র তাপপ্রবাহ হয়ে গেছে। অর্থাৎ সর্বোচ্চ তাপমাত্রা ৪০ ডিগ্রি সেলসিয়াস অতিক্রম করে গেছে। অর্ধেকের বেশি জেলার সর্বোচ্চ তাপমাত্রা ৩৬ থেকে ৪০ ডিগ্রি সেলসিয়াসের মধ্যে ছিল।\n" +
            "আবহাওয়া অধিদপ্তরের হিসাবে, গতকাল ঢাকায় দিনের তাপমাত্রা উঠে ৩৯ দশমিক ২ ডিগ্রি সেলসিয়াসে। আর সর্বনিম্ন তাপমাত্রা ছিল ২৮ দশমিক ২ ডিগ্রি। গতকাল দেশের সর্বোচ্চ তাপমাত্রা ছিল যশোরে ৪২ দশমিক ৪ ডিগ্রি সেলসিয়াস। আর সর্বনিম্ন তাপমাত্রা ছিল তেঁতুলিয়ায় ১৭ দশমিক ৭ ডিগ্রি সেলসিয়াস।",

           //second
            "সাতক্ষীরায় কাঠবোঝাই ট্রলির ধাক্কায় মোটরসাইকেলের আরোহী বাবা ও ছেলে নিহত হয়েছেন। গতকাল বৃহস্পতিবার রাত সাড়ে দশটার দিকে সদর উপজেলার কদমতলা-বৈকারী সড়কের আঁগরদাড়ি মাদ্রাসার সামনে এই দুর্ঘটনা ঘটে।\n" +
                    "\n" +
                    "নিহত দুজন হলেন সদর উপজেলার বৈকারী গ্রামের হাফিজুর ইসলাম (৫৭) ও তাঁর ছেলে আজিজুর রহমান সদর উপজেলার আঁগরদাড়ি ইউনিয়ন পরিষদের (ইউপি) চেয়ারম্যান মিলন হোসেন জানান, হাফিজুর ইসলাম ও তাঁ ছেলে আজিজুর রহমান মোটরসাইকেলে করে বৃহস্পতিবার রাতে সাতক্ষীরা শহর থেকে বৈকারীর বাড়িতে যাচ্ছিলেন। রাত সাড়ে দশটার দিকে তাঁরা কদমতলা-বৈকারী সড়কের আঁগরদাড়ি মাদ্রাসার সামনে পৌঁছান। তখন বিপরীত দিক থেকে আসা কাঠবোঝাই একটি ট্রলি মোটরসাইকেলটিকে ধাক্কা দেয়। এতে মোটরসাইকেলের দুই আরোহী ঘটনাস্থলে নিহত হন।\n" +
                    "\n" +
                    "সাতক্ষীরা সদর থানার পরিদর্শক (তদন্ত) নজরুল ইসলাম জানান, নিহত দুজনের মরদেহ উদ্ধার করে সাতক্ষীরা সদর থানায় নিয়ে আসা হয়েছে। আজ শুক্রবার সকাল ১০টার দিকে ময়নাতদন্তের জন্য লাশ পাঠানো হবে সাতক্ষীরা সদর হাসপাতালে। ট্রলিটি জব্দ করা হয়েছে, তবে চালককে পাওয়া যায়নি। ",
            //third
            "স্পেশাল ব্রাঞ্চ, বাংলাদেশ পুলিশ, রাজারবাগ, ঢাকা একাধিক পদে জনবল নিয়োগে বিজ্ঞপ্তি প্রকাশ করেছে। এই প্রতিষ্ঠানে রাজস্ব খাতভুক্ত ৪ ক্যাটাগরির পদে ১১ থেকে ২০তম গ্রেডে মোট ৫৪ জনকে নিয়োগ দেওয়া হবে। আগ্রহী প্রার্থীদের অনলাইনে আবেদন করতে হবে।\n" +
            "\n" +
            "১. পদের নাম: কম্পিউটার অপারেটর\n" +
            "পদসংখ্যা: ২\n" +
            "যোগ্যতা: স্বীকৃত বিশ্ববিদ্যালয় থেকে বিজ্ঞান বিভাগে স্নাতক (সম্মান) বা সমমানের ডিগ্রি। কম্পিউটার মুদ্রাক্ষরে প্রতি মিনিটে বাংলায় ২৫ শব্দ ও ইংরেজিতে ৩০ শব্দের গতিসহ সংশ্লিষ্ট বিষয়ে স্ট্যান্ডার্ড অ্যাপটিটিউড টেস্টে উত্তীর্ণ হতে হবে।\n" +
            "বয়স: অন্যূন ৩০ বছর\n" +
            "বেতন স্কেল: ১২,৫০০-৩০,২৩০ টাকা (গ্রেড-১১) " +
            "২. পদের নাম: সাঁটলিপিকার কাম কম্পিউটার অপারেটর\n" +
            "পদসংখ্যা: ৫\n" +
            "যোগ্যতা: স্বীকৃত বিশ্ববিদ্যালয় থেকে অন্যূন দ্বিতীয় বিভাগ বা সমমানের সিজিপিএতে স্নাতক বা সমমানের ডিগ্রি। কম্পিউটার ব্যবহারে দক্ষতা। সাঁটলিপিতে প্রতি মিনিটে ইংরেজি ও বাংলায় যথাক্রমে ৮০ ও ৫০ শব্দের গতি থাকতে হবে এবং কম্পিউটার মুদ্রাক্ষরে প্রতি মিনিটে বাংলায় ৩০ শব্দ ও ইংরেজিতে ২৫ শব্দের গতি থাকতে হবে।\n" +
            "বয়স: অন্যূন ৩০ বছর। তবে বিভাগীয় প্রার্থীর ক্ষেত্রে বয়সসীমা ৪০ বছর পর্যন্ত শিথিলযোগ্য।\n" +
            "বেতন স্কেল: ১১,০০০-২৬,৫৯০ টাকা (গ্রেড-১৩)  ৩. পদের নাম: অফিস সহকারী কাম কম্পিউটার মুদ্রাক্ষরিক\n" +
            "পদসংখ্যা: ৩৮\n" +
            "যোগ্যতা: অন্যূন দ্বিতীয় বিভাগ বা সমমানের জিপিএতে এইচএসসি বা সমমান পাস। কম্পিউটার ব্যবহারে দক্ষতা। কম্পিউটার মুদ্রাক্ষরে প্রতি মিনিটে বাংলায় ২০ শব্দ ও ইংরেজিতে ২০ শব্দের গতি থাকতে হবে।\n" +
            "বয়স: অন্যূন ৩০ বছর। তবে বিভাগীয় প্রার্থীর ক্ষেত্রে বয়সসীমা ৪০ বছর পর্যন্ত শিথিলযোগ্য।\n" +
            "বেতন স্কেল: ৯,৩০০-২২,৪৯০ টাকা (গ্রেড-১৬)\n" +
            "\n" +
            "৪. পদের নাম: দপ্তরি\n" +
            "পদসংখ্যা: ৯\n" +
            "যোগ্যতা: এসএসসি বা সমমান পাস।\n" +
            "বয়স: অন্যূন ৩০ বছর।\n" +
            "বেতন স্কেল: ৮,২৫০-২০,০১০ টাকা (গ্রেড-২০)\n" +
            "\n" +
            "\n" +
            "যেসব জেলার প্রার্থী আবেদন করতে পারবেন: ১ থেকে ৩ নম্বর পদের ক্ষেত্রে ঢাকা, গাজীপুর মানিকগঞ্জ, মুন্সিগঞ্জ, নারায়ণগঞ্জ, নরসিংদী, কিশোরগঞ্জ, টাঙ্গাইল, ফরিদপুর, মাদারীপুর, রাজবাড়ী, ময়মনসিংহ, জামালপুর, শেরপুর, নেত্রকোনা, চট্টগ্রাম, কক্সবাজার খাগড়াছড়ি, রাঙামাটি, কুমিল্লা, ব্রাহ্মণবাড়িয়া, চাঁদপুর, নোয়াখালী, ফেনী, বগুড়া, পাবনা, সিরাজগঞ্জ, রাজশাহী, নওগাঁ, রংপুর, চাঁপাইনবাবগঞ্জ, ঠাকুরগাঁও, কুড়িগ্রাম, নীলফামারী, বাগেরহাট, যশোর,  ঝিনাইদহ, মাগুরা, নড়াইল, কুষ্টিয়া, মেহেরপুর, বরগুনা, পটুয়াখালী, সিলেট, হবিগঞ্জ, মৌলভীবাজার ও সুনামগঞ্জ।\n" +
            "\n" +
            "৪ নম্বর পদের ক্ষেত্রে ঢাকা, গাজীপুর মানিকগঞ্জ, মুন্সিগঞ্জ, নারায়ণগঞ্জ, নরসিংদী, কিশোরগঞ্জ, টাঙ্গাইল, গোপালগঞ্জ, মাদারীপুর রাজবাড়ী, শরীয়তপুর, ময়মনসিংহ, নেত্রকোনা, চট্টগ্রাম, কক্সবাজার, খাগড়াছড়ি, বান্দরবান, রাঙামাটি, ব্রাহ্মণবাড়িয়া, চাঁদপুর, নোয়াখালী, বগুড়া, জয়পুরহাট, সিরাজগঞ্জ, নওগাঁ, নাটোর, চাঁপাইনবাবগঞ্জ, দিনাজপুর, পঞ্চগড়, ঠাকুরগাঁও, রংপুর, লালমনিরহাট, কুড়িগ্রাম, খুলনা, সাতক্ষীরা, যশোর, নড়াইল, কুষ্টিয়া, চুয়াডাঙ্গা, মেহেরপুর, ভোলা, বরগুনা, সিলেট, হবিগঞ্জ, মৌলভীবাজার ও সুনামগঞ্জ।\n" +
            "\n" +
            "তবে এতিম ও শারীরিক প্রতিবন্ধীদের ক্ষেত্রে সব জেলার প্রার্থী আবেদন করতে পারবেন।\n" +
            "\n" +
            "আরও পড়ুন  বয়সসীমা\n" +
            "১ এপ্রিল ২০২৪ তারিখে আবেদনকারীর বয়স ১৮ থেকে ৩০ বছরের মধ্যে হতে হবে। বীর মুক্তিযোদ্ধা/শহীদ বীর মুক্তিযোদ্ধার সন্তান এবং শারীরিক প্রতিবন্ধী প্রার্থীদের বয়স ১৮ থেকে ৩২ বছর। তবে বীর মুক্তিযোদ্ধা/শহীদ বীর মুক্তিযোদ্ধার নাতি-নাতনিদের ক্ষেত্রে বয়স ১৮ থেকে ৩০ বছর হতে হবে।\n" +
            "\n" +
            "আবেদন যেভাবে\n" +
            "আগ্রহী প্রার্থীদের এই ওয়েবসাইট বা এই ওয়েবসাইটে ফরম পূরণের মাধ্যমে আবেদন করতে হবে। নিয়োগসংক্রান্ত বিস্তারিত তথ্য একই ওয়েবসাইটে পাওয়া যাবে।আবেদন ফি\n" +
            "অনলাইনে ফরম পূরণের অনধিক ৭২ ঘণ্টার মধ্যে পরীক্ষার ফি বাবদ ১ নম্বর পদের জন্য ৩০০ টাকা ও টেলিটকের সার্ভিস চার্জ ৩৫ টাকাসহ মোট ৩৩৫ টাকা; ২ ও ৩ নম্বর পদের জন্য ২০০ টাকা ও টেলিটকের সার্ভিস চার্জ ২৩ টাকাসহ মোট ২২৩ টাকা এবং ৪ নম্বর পদের জন্য ১০০ টাকা ও টেলিটকের সার্ভিস চার্জ ১২ টাকাসহ মোট ১১২ টাকা টেলিটক প্রিপেইড মোবাইল নম্বর থেকে এসএমএসের মাধ্যমে জমা দিতে হবে।\n" +
            "\n" +
            "আবেদনের শেষ সময়: ১৬ মে ২০২৪, বিকেল ৫টা পর্যন্ত।\n" +
            "\n",
            //four
            "প্রচণ্ড তাপপ্রবাহ ও অসহনীয় গরমে জনজীবনে দুর্বিষহ অবস্থা। এর মধ্যে আবার ব্যায়াম! কিন্তু এ গরমেও সুস্থ থাকতে ব্যায়াম করতেই হবে। ডায়াবেটিস, হৃদ্\u200Cরোগ, স্থূলতা বা রক্তে বাড়তি চর্বির রোগীদের ব্যায়াম ব্যাহত হলে ক্ষতির আশঙ্কা থাকে। তাই ব্যায়ামের বিকল্প নেই। শরীর সুস্থ রাখতে বছরের যেকোনো সময় নিয়মিত ব্যায়াম করতেই হবে।\n" +
            "\n" +
            "গ্রীষ্মকালীন ব্যায়াম বলে কিছু নেই। সাধারণত যেসব ব্যায়াম করেন, সেগুলোই এ সময় করতে পারেন। তবে গরমের সময় দুপুরে বা রোদে ব্যায়াম করা ঠিক নয়। প্রচণ্ড গরমে হিটস্ট্রোক, ডিহাইড্রেশন ইত্যাদি সমস্যা দেখা দেয়। এ সময় ব্যায়াম করলে ঘাম বেশি হয়। তাই ব্যায়াম বা হাঁটার জন্য ভোর বা সন্ধ্যা বেছে নিন। যা করতে পারেন\n" +
            "● বাইরে না গিয়ে বাড়িতেও হালকা ব্যায়াম করতে পারেন। প্রতিদিন নির্দিষ্ট সময় কমপক্ষে ১০ মিনিট দড়িলাফ দিতে পারেন। দিন দিন সময় আরও বাড়িয়ে দিন। কম সময়ের জন্য সহজ ব্যায়াম এটি।\n" +
            "\n" +
            "● বাসায় নিয়ম করে কিছুক্ষণ হাঁটাহাঁটি করুন। \n" +
            "\n" +
            "● কোনো শপিং মল বা মার্কেটেও ঘুরতে যেতে পারেন। সেখানে কিছু পছন্দের বা প্রয়োজনীয় জিনিসপত্রও কেনা হবে, আবার ব্যায়ামও \n" +
            "হয়ে যাবে। \n" +
            "\n" +
            "\n" +
            "● ইয়োগা বা ধ্যানও করতে পারেন। এটি কোনো ঘাম না ঝরালেও শরীর সুস্থ রাখতে সাহায্য করবে। \n" +
            "\n" +
            "● লিফট ব্যবহার করা থেকে বিরত থাকুন। সিঁড়ি ব্যবহার করুন। \n" +
            "\n" +
            "● দুপুরে ও রাতে খাওয়ার পর ছাদে বা বাড়ির সামনের ফাঁকা জায়গায় বা সামনের রাস্তায় একটু হেঁটে আসুন। \n" +
            "\n" +
            "● গরমকালে সবচেয়ে ভালো ব্যায়ামগুলোর একটি সাঁতার। এতে গরমের যন্ত্রণা থেকেও রেহাই মেলে। \n" +
            "\n" +
            "● ভালো করে ধুয়েমুছে শুয়ে পড়ুন শীতল মেঝের ওপর। মেঝের শীতলতা আপনাকে গরম থেকে মুক্তি দেবে। শুয়ে কিছু ব্যায়ামও করতে পারেন; যা আপনার কোমরে কিংবা পিঠে ব্যথা থাকলে সারিয়ে দেবে। \n" +
            "\n" +
            "● বিভিন্ন ধরনের স্ট্রেচিং ব্যায়াম, যেমন আর্ম স্ট্রেচিং বা লেগ লিফটিং করতে পারেন। এতে খুব একটা ঘাম হয় না, কিন্তু রক্ত সঞ্চালন ভালো হয় এবং চর্বি ঝরে যায়।\n" +
            "\n" +
            "●সাইকেল চালানোর অভ্যাসও করতে পারেন। এতে একদিকে যেমন ব্যায়াম হবে, অন্যদিকে বাতাস লাগার কারণে গরমে আরাম লাগবে।\n" +
            "\n" +
            "এম ইয়াছিন আলী, চেয়ারম্যান ও চিফ কনসালট্যান্ট, ঢাকা সিটি ফিজিওথেরাপি হাসপাতাল, ধানমন্ডি আ/এ, ঢাকা",
           //five
            "ব্রাইটনকে ব্রাইটনের মাঠে ৪-০ গোলে হারিয়ে ইংলিশ প্রিমিয়ার লিগে পয়েন্ট তালিকার দ্বিতীয়স্থানে উঠে এসেছে ম্যানচেস্টার সিটি। ৩৩ ম্যাচে ৭৬ পয়েন্ট দলটির, এক ম্যাচ বেশি খেলা আর্সেনালের পয়েন্ট ৭৭। সর্বশেষ তিনবারের চ্যাম্পিয়নরা অ্যামেক্স স্টেডিয়ামে রাজকীয় ফুটবল খেলেই বড় জয় তুলে নিয়ে শিরোপা জয়ের পথে আরেকটি এগিয়েছে। চোটের কারণে ম্যাচটি খেলেননি আর্লিং হলান্ড।\n" +
                    "\n" +
                    "টানা চতুর্থ লিগ শিরোপায় চোখ রাখা সিটি কাল প্রথমার্ধেই এগিয়ে যায় ৩-০ গোলে। ১৭ মিনিটে কেভিন ডি ব্রুইনার হেডে এগিয়ে যায় দলটি। সিটির জার্সিতে প্রিমিয়ার লিগে ডি ব্রুইনার এটিই হেড দিয়ে করা প্রথম গোল। ৯ মিনিট পরে ব্যবধানটা দ্বিগুণ করেন ফিল ফোডেন। গোলটি নিয়ে একটু বিতর্ক আছে। ফোডেন পা পিছলে পড়ে গেলেও রেফারি ফাউলের বাঁশি বাজিয়ে ফ্রিকিক দেন। ফোডেনের নেওয়া ফ্রিকিক পাসকাল গ্রসের শরীরে লেগে দিক বদলে গোলরক্ষককে বিভ্রান্ত করে ঢুকে যায় জালে।তবে ৩৪ মিনিটে ফোডেনের করা দ্বিতীয় গোলটি নিয়ে প্রশ্ন তোলার সুযোগই ছিল না। প্রথমার্ধেই ৩-০ গোলে এগিয়ে যাওয়া সিটি চতুর্থ গোলটি পায় ৬২ মিনিটে, গোলটি করেন আর্জেন্টিনার বিশ্বকাপজয়ী তারকা হুলিয়ান আলভারেজ।" +
                    "এই জয়ের পর শিরোপা দৌড়ে আরেকটু এগিয়ে গেলেও সিটি কোচ পেপ গার্দিওলা মনে করছেন কোনো কিছুই নিশ্চিত হয়নি এখনো। জমজমাট শিরোপা লড়াইয়ের কথা মনে করিয়ে দিয়ে স্প্যানিশ কোচ বললেন পা হড়কানোর কোনোই সুযোগ নেই, ‘আমাদের জন্য এটা ভালো ফল, আসলেই ভালো ফল। আমিও আগেও বলেছি, আগে যা করেছি সেগুলো অতীত, এর মানে এই না যে ভবিষ্যতেও একই কাজ করে যেতে পারব আমরা। আমরা জানি ব্যবধানটা খুবই কম। আমাদের প্রতিটি ম্যাচই জিততে হবে। প্রতি ম্যাচই আমাদের আরও কাছে নিয়ে যাবে।’" +
                    "লিভারপুলের সাম্প্রতিক পথ হারানোর কথা মনে করেই সাবধানী গার্দিওলা বললেন আত্মপ্রসাদে ভোগার কোনোই সুযোগ নেই, ‘লিভারপুলের কী হয়েছে, টানা দুটি ম্যাচ হেরেছে। এমনটা হতে পারে আর্সেনালের, এমনটা হতে পারে আমাদেরও। সবচেয়ে গুরুত্বপূর্ণ হলো আমরা এখনো লড়াইয়ে আছি। আর সেখানে আরও অনেক ম্যাচ খেলতে হবে।’লিগে টানা ১৮ ম্যাচে অপরাজিত সিটি এরপর রোববার খেলবে নটিংহাম ফরেস্টের বিপক্ষে। ওই দিনই লিগের শীর্ষ দল আর্সেনাল মুখোমুখি হবে টটেনহামের। নর্থ লন্ডন ডার্বিটি হবে টটেনহামের মাঠে।",
           //six
            "সরকারের পক্ষ থেকে আশ্বস্ত করা হয়েছিল যে এবার ঈদযাত্রা নিরাপদ হবে। কিন্তু রোড সেফটি ফাউন্ডেশনের হিসাব অনুযায়ী, ঈদের আগে ও পরের ১৫ দিনে ৩৫৮টি দুর্ঘটনায় ৩৬৭ জন নিহত এবং ১ হাজার ৫০০ আহত হয়েছেন। দুর্ঘটনার কারণ হিসেবে ত্রুটিপূর্ণ যানবাহন, বেপরোয়া গতি, চালকদের অদক্ষতা ও শারীরিক–মানসিক অসুস্থতাকে চিহ্নিত করা হয়েছে।\n" +
                    "\n" +
                    "গত সোমবার চট্টগ্রাম প্রকৌশল বিশ্ববিদ্যালয়ের (চুয়েট) কাছে জিয়ানগর এলাকায় চট্টগ্রাম–কাপ্তাই সড়কে একটি বাস ধাক্কা দিলে মোটরসাইকেলে থাকা দুই শিক্ষার্থী মারা যান। তাঁরা হলেন চুয়েটের পুরকৌশল বিভাগের তৃতীয় বর্ষের শিক্ষার্থী শান্ত সাহা ও একই বিভাগের দ্বিতীয় বর্ষের তৌফিক হোসাইন।" +
                    "এ দুর্ঘটনার পর বিশ্ববিদ্যালয়ের শিক্ষার্থীরা ১০ দফা দাবিতে আন্দোলন করেন। তাঁদের দাবির মধ্যে আছে ক্যাম্পাসের পাশের চট্টগ্রাম–কাপ্তাই সড়ক চার লেন করা, নিহত দুই শিক্ষার্থীর পরিবারকে দুই কোটি টাকা করে ক্ষতিপূরণ, বাসের চালক ও মালিককে গ্রেপ্তার এবং বিশ্ববিদ্যালয়ের শিক্ষার্থীদের জন্য প্রয়োজনীয় বাস ও অ্যাম্বুলেন্সের ব্যবস্থা করা। ইতিমধ্যে বাসের চালককে গ্রেপ্তার করা হলেও মালিক ধরাছোঁয়ার বাইরে। \n" +
                    "\n" +
                    "মোটরসাইকেলে ধাক্কা দেওয়া বাসটির ফিটনেস ছিল না। ছাত্রদের আন্দোলনের মুখে চুয়েট কর্তৃপক্ষ বৃহস্পতিবার অনির্দিষ্টকালের জন্য বিশ্ববিদ্যালয় বন্ধ ঘোষণা করে। এতে ছাত্ররা ক্ষুব্ধ হয়ে ক্যাম্পাসে থাকা শাহ আমানত পরিবহনের একটি বাসে আগুন দেন। \n" +
                    "\n" +
                    "রোড সেফটি ফাউন্ডেশনের তথ্য অনুযায়ী, গত তিন মাসে সড়ক দুর্ঘটনায় যত মানুষের মৃত্যু হয়েছে, তার ১৩ শতাংশই শিক্ষার্থী। সংখ্যার হিসাবে ২২৫ জন। অর্থাৎ দিনে গড়ে দুজন শিক্ষার্থীর মৃত্যু হয়েছে সড়কে। বাংলাদেশ প্রকৌশল বিশ্ববিদ্যালয়ের (বুয়েট) সড়ক দুর্ঘটনা গবেষণা ইনস্টিটিউটের সাবেক পরিচালক অধ্যাপক মো. হাদীউজ্জামান প্রথম আলোকে বলেন, সড়কে কর্মক্ষম ব্যক্তি ও শিক্ষার্থীদের চলাচল বেশি, তাই সড়ক অব্যবস্থাপনার শিকারও তাঁরা বেশি হচ্ছেন। \n" +
                    "উল্লেখ্য, নিরাপদ সড়কের দাবিতে ২০১৮ সালে ছাত্রদের দেশকাঁপানো আন্দোলনের মুখে সরকার সড়ক পরিবহন আইন পাস করে, যা সর্বমহলে প্রশংসিত হয়েছিল। কিন্তু আইনটি বাস্তবায়ন করা যায়নি পরিবহনমালিক ও শ্রমিকদের আপত্তির কারণে। ফলে সড়কে বিশৃঙ্খলা ও দুর্ঘটনায় প্রাণহানির সংখ্যা আরও বেড়েছে। \n" +
                    "\n" +
                    "রোড সেফটি ফাউন্ডেশন বলেছে, এবার ঈদে দুর্ঘটনায় যে মানবসম্পদের ক্ষতি হয়েছে, তার আর্থিক মূল্য ১ হাজার ৩৩০ কোটি টাকা। আমরা এ–ও জানি, মানুষের জীবনের যে ক্ষতি, তা অর্থ দিয়ে পূরণ করা যায় না। তারপরও চুয়েট শিক্ষার্থীরা নিহত দুই সহপাঠীর পরিবারকে যে দুই কোটি টাকা করে ক্ষতিপূরণ দিতে বলেছেন, তা দৃঢ়ভাবে সমর্থন করি। এর আগেও আদালত ও সংশ্লিষ্ট কর্তৃপক্ষ পরিবহনমালিকদের ক্ষতিপূরণ দেওয়ার নির্দেশ দিয়েছেন। কিন্তু অনেক ক্ষেত্রেই সেটি উপেক্ষিত হয়েছে।\n" +
                    "\n" +
                    "রোড সেফটি ফাউন্ডেশন ও যাত্রী কল্যাণ সমিতি ঈদের ছুটিতে দুর্ঘটনার যে হিসাব দিয়েছে, তা পূর্ণাঙ্গ নয়। সাধারণত সংবাদমাধ্যমের তথ্যের ওপর নির্ভর করেই তারা এই হিসাব দিয়ে থাকে। অনেক মৃত্যুর খবর সংবাদমাধ্যমে আসে না, থানায়ও রেকর্ড করা হয় না। \n" +
                    "\n" +
                    "এই যে ঈদের ছুটিতে সাড়ে তিন শতাধিক মানুষ প্রাণ হারালেন, এ জন্য পরিবহনমালিক ও চালকদের পাশাপাশি তদারকি সংস্থাও দায় এড়াতে পারে না। ফিটনেসবিহীন যানবাহন সড়কে নামার পরও বিআরটিএ কিংবা হাইওয়ে পুলিশ ব্যবস্থা নিল না কেন? ২০১৮ সালে ঢাকায় রমিজউদ্দিন স্কুল ও কলেজের দুই শিক্ষার্থীর মৃত্যুর পর ছাত্র–তরুণেরা রাস্তায় নেমেছিলেন। সাড়ে পাঁচ বছর পর চুয়েটের দুই শিক্ষার্থীর মৃত্যুর পর আবার শিক্ষার্থীরা আন্দোলন করছেন। এর শেষ কোথায়? সড়কে আর কত মানুষ মারা গেলে পরিবহনমালিক–শ্রমিক ও বিআরটিএর ঘুম ভাঙবে?\n" +
                    "\n",
                //seven
            "চট্টগ্রামের ঐতিহ্যবাহী লালদিঘী ময়দানে বৈশাখী মেলার ১১৫তম আসর শুরু হয়েছে। লালদীঘির পেট্রলপাম্প, জেলা পরিষদ মার্কেট চত্বর, সিনেমা প্যালেস থেকে হাজারী গলির মুখ পর্যন্ত মাটির তৈজসপত্র, শোপিস, ফুলদানি, হাতি-ঘোড়া, মাটির ব্যাংকের বড় বড় স্তূপ। জমজমাট বেচাকেনা চলছে। হৃদয়কাড়া মৃৎশিল্প, কুটিরশিল্প, গ্রামীণ নানা পণ্যসামগ্রী দেখেই সেসব কিনতে ভিড় করছেন ক্রেতারা। কাচ, পাট, সুতা, বাঁশ, বেত, কচুরিপানা, কাঠসহ বিভিন্ন উপকরণ দিয়ে তৈরি আকর্ষণীয় সব বাতি, শোপিস, আয়না, খেলনার দোকানগুলোতে  তরুণ-তরুণীদের ভিড়।",
    //eight
            "সৌদি আরবের যেকোনো ধরনের ভিসাধারী একজন মুসল্লি এখন থেকে পবিত্র ওমরাহ পালন করতে পারবেন। ওমরাহ–সম্পর্কিত নীতিমালা শিথিল করে এ ঘোষণা দিয়েছে দেশটির কর্তৃপক্ষ।\n" +
                    "\n" +
                    "সৌদি আরবের হজ ও ওমরাহবিষয়ক মন্ত্রণালয় এক্সে (সাবেক টুইটার) দেওয়া এক পোস্টে বলেছে, ‘যেকোনো দেশ থেকে আসা একজন মুসল্লি যেকোনো ভিসায় সহজে ও স্বস্তির সঙ্গে পবিত্র ওমরাহ পালন করতে পারবেন।’" +
                    "ব্যক্তিগত, পারিবারিক, ট্রানজিট, শ্রম, ই–ভিসাসহ সব ধরনের ভিসাধারীই ওমরাহ পালনের ক্ষেত্রে নতুন এ  সুবিধার আওতায় আসবেন বলে জানিয়েছে মন্ত্রণালয়।\n" +
                    "\n" +
                    "মন্ত্রণালয় বলেছে, ‘আপনার ভিসা যে ধরনেরই হোক, আপনি ওমরাহ পালন করতে পারবেন।’\n" +
                    "\n" +
                    "ওমরাহ পালনের অনুমতি পেতে আগ্রহী ব্যক্তিদের নুসুক অ্যাপ ব্যবহারে উৎসাহিত করেছে কর্তৃপক্ষ। পবিত্র মসজিদুল হারামে একজন মুসল্লি কখন ওমরাহ পালন করতে চান, সেটি অ্যাপে উল্লেখ করতে বলা হয়েছে।\n" +
                    "\n" +
                    "ওমরাহ পালনকালে আবাসনসংক্রান্ত বিষয়ে বোঝাপড়া ও পবিত্র মদিনায় সফরে যাওয়াসহ বিভিন্ন প্রক্রিয়া নুসুক প্ল্যাটফর্মের মাধ্যমে সম্পন্ন করা যায়।\n" +
                    "\n" +
                    "\n" +
                    "সাম্প্রতিক মাসগুলোতে সৌদি আরব ওমরাহ পালনে দেশটিতে আসতে বহির্বিশ্বের মুসল্লিদের জন্য নানা উদ্যোগ নিয়েছে।\n" +
                    "\n" +
                    "বিশ্বের কোটি কোটি মুসলিম, বিশেষ করে যাঁরা শারীরিক বা অর্থনৈতিক কারণে পবিত্র হজ পালনে আসতে পারেন না, তাঁদের ওমরাহ পালনের সুযোগ করে দেওয়াই এসব উদ্যোগের লক্ষ্য।\n" +
                    "\n" +
                    "সম্প্রতি নেওয়া এসব উদ্যোগের মধ্যে আছে ওমরাহ ভিসার মেয়াদ ৩০ দিন থেকে বাড়িয়ে ৯০ দিন করা, ভূমি, আকাশ ও সমুদ্রপথের যেকোনোটির মাধ্যমে সৌদি আরবে আসার ভিসা প্রদান, নারীদের জন্য পুরুষ অভিভাবক সঙ্গে রাখার বিধান বাতিল করা ইত্যাদি।\n" +
                    "\n" +
                    "আরও পড়ুন" +
                    "এর বাইরে উপসাগরীয় সহযোগিতা সংস্থাভুক্ত (জিসিসি) দেশগুলোতে বসবাসকারী প্রবাসী নাগরিক এবং শেনজেন, যুক্তরাষ্ট্র ও যুক্তরাজ্যের ভিসাধারীরা এখন থেকে সৌদি আরবে যাওয়ার আগেই নুসুক অ্যাপের মাধ্যমে ওমরাহ পালনের অনুমতি নিতে পারবেন।"
    };
            Integer[] imageId = {R.drawable.img, R.drawable.img2, R.drawable.img3,R.drawable.img4,R.drawable.img5,R.drawable.img6,R.drawable.img7,R.drawable.img8};
    String[] timedate = {" প্রকাশ: ২৬ এপ্রিল ২০২৪, ০৯: ১২,"," প্রকাশ: ২৬ এপ্রিল ২০২৪, ০৯: ২০"," প্রকাশ: ২৬ এপ্রিল ২০২৪, ০৮: ০৫","প্রকাশ: ২৫ এপ্রিল ২০২৪, ১২: ১২","আপডেট: ২৬ এপ্রিল ২০২৪, ০৯: ৩৩ ","প্রকাশ: ২৬ এপ্রিল ২০২৪, ০৯: ২২","আপডেট: ২৬ এপ্রিল ২০২৪, ১১: ২৩ ","প্রকাশ: ২৬ এপ্রিল ২০২৪, ১১: ২৭"};
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        list = findViewById(R.id.list);

        CustomAdapter listAdapter = new CustomAdapter(MainActivity.this, title , location, description, timedate, imageId);
        list.setAdapter(listAdapter);

        list.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                Intent intent = new Intent(MainActivity.this, MainActivity2.class);
                intent.putExtra("title ", title [position]);
                intent.putExtra("location", location[position]);
                intent.putExtra("description", description[position]);
                intent.putExtra("timedate", timedate[position]);
                intent.putExtra("imageId", imageId[position]);
                startActivity(intent);
            }
        });
    }
}


